{"test":{"revisions":0,"cachedHtml":"<p>tester</p>\n"},"CoolCoderSJ":{"cachedHtml":"<p>CoolCoderSJ is a repl user quite unknown.</p>\n<p>He has many achievements, which shall be listed one by one.</p>\n<ul>\n<li>I MADE MY OWN URL SHORTENER AND BEAT BITLY! WOOT!</li>\n</ul>\n<p>My URL Shortener vs. Bitly -</p>\n<p><a href=\"https://cdn.discordapp.com/attachments/439966584501436416/801193386799267911/SJURLPromo.PNG\">Cheggit here</a></p>\n<ul>\n<li>I made a QR Code Generator, now under maintenance.</li>\n</ul>\n<p>I made a Python Tutorial - </p>\n<h3>IMPORTANT LINKS</h3>\n<ul>\n<li><a href=\"https://sjurl.repl.co/pytutorial\">Interactive Online (Recommended)</a></li>\n<li><a href=\"https://sjurl.repl.co/pytutorialo\">Non-Interactive Online</a></li>\n<li><a href=\"https://sjurl.repl.co/pytutorialpdf\">Non-Interactive PDF</a></li>\n<li><a href=\"https://sjurl.repl.co/pytutorialipynb\">Interactive Jupyter (Also Recommended)</a></li>\n</ul>\n<p>Finally, my <a href=\"https://sjurl.repl.co/portfolio\">portfolio</a></p>"},"Javascript":{"revisions":0,"cachedHtml":"<h1>Overview</h1>\n<p>Javascript (/ˈdʒɑːvəˌskrɪpt/)</p>\n<p>An interpreted weakly typed language. It plays an important role in web page interactivity and behavior.</p>\n<p><code>.js</code>, <code>.mjs</code>, <code>.cjs</code></p>\n<hr />\n<p>According to this poll:</p>\n<p><strong>95%</strong> despise JavaScript\n<strong>5%</strong> love Javascript  </p>\n<h2>~~<strong>100%</strong> of Javascripters write spaghetti code~~</h2>\n<p>Javascript is very powerful language with flexible syntax ~~and strange behavior like your introverted 2nd cousin who stares creepily at everyone during the family reunion~~</p>\n<p>Javascript brings life to the web, making webpages interactive and other fun stuff. It can also be used to host a webserver or just to do stuff in the console.\nbump</p>"},"cats":{"revisions":0,"cachedHtml":"<p>Cats are dumb, funny, and having them are like hiring a mini batman to run around your house</p>"},"EpicGamer007":{"revisions":0,"cachedHtml":"<h1>EpicGamer007 is a repl user</h1>\n<p><a href=\"https://repl.it/@programmeruser\">@programmeruser</a> this is pretty poggers :))</p>\n<p>md is awesome too :)))</p>"},"angrydoge":{"revisions":0,"cachedHtml":"<p><a href=\"https://wiki.programmeruser.repl.co\">Home</a></p>\n<pre><code> ________________________\n|   Table of contents   |\n|_______________________|\n|                       |\n|     Basic info        |\n| Interests and hobbies |\n\\                       |\\\n/_________________________/\n</code></pre>\n<h1>Basic info</h1>\n<p>angrydoge is a programmer on <a href=\"https://repl.it\">Repl.it</a> whos main language is <a href=\"https://python.org\">Python</a>. He also knows HTML and CSS.</p>\n<p>angrydoge is pretty amateur HTML, <a href=\"https://wiki.programmeruser.repl.co/article/Javascript\">JS</a>, and CSS, but knows a lot of <a href=\"https://python.org\">Python</a>. He mostly uses the console in python, but wants to learn Tkinter. He also has several friends on <a href=\"https://repl.it\">Repl.it</a> who help him with HTML and CSS like <a href=\"https://repl.it/@tussiez\">Tussiez</a> and <a href=\"https://repl.it/baconman123\">Baconman123</a>.</p>\n<h1>Interests and hobbies</h1>\n<p>As you probably guesses, angrydoge loves to code, using mostly <a href=\"https://repl.it\">Repl.it</a> but sometimes messes around with the <a href=\"https://wikidot.com\">Wikidot</a> syntax. He even made <a href=\"https://coding-wiki.wikidot.com\">his own site</a>.\nHe also has a bit of a <a href=\"https://its.dabombdgdzjr.repl.co\">portfolio</a>.</p>\n<p>He also messes around with synthesia, and loves watching them. His favorite is <a href=\"https://www.youtube.com/watch?v=Qskm9MTz2V4\">Rush E</a> by [sheet music boss]. If youtube is blocked, try <a href=\"https://www.youtube-nocookie.com/watch?v=Qskm9MTz2V4\">here</a>.</p>"},"All Dogs Go To Heaven 2":{"revisions":0,"cachedHtml":"<p>some dogs go to heaven blah blah gordan freeman dies at the end due to personal reasons</p>\n<p>poop tastes good lol</p>\n<p>Written By elizurfkk</p>"},"head, thee pagchamp":{"revisions":0,"cachedHtml":"<p>Thine divine \"pogger\" hast been banneth on \"twitch\" thy is woeful.</p>\n<p>Written By FSB</p>\n<p>Comment by a user: OUCH</p>"},"Chair":{"revisions":0,"cachedHtml":"<p>One of the basic pieces of furniture, a chair is a type of seat. Its primary features are two pieces of a durable material, attached as back and seat to one another at a 90° or slightly greater angle, with usually the four corners of the horizontal seat attached in turn to four legs—or other parts of the seat's underside attached to three legs or to a shaft about which a four-arm turnstile on rollers can turn—strong enough to support the weight of a person who sits on the seat (usually wide and broad enough to hold the lower body from the buttocks almost to the knees) and leans against the vertical back (usually high and wide enough to support the back to the shoulder blades).</p>\n<p>The legs are typically high enough for the seated person's thighs and knees to form a 90° or lesser angle. [1][2] Used in a number of rooms in homes (e.g. in living rooms, dining rooms, and dens), in schools and offices (with desks), and in various other workplaces, chairs may be made of wood, metal, or synthetic materials, and either the seat alone or the entire chair may be padded or upholstered in various colors and fabrics.</p>\n<p>Written by FSB</p>"},"spam":{"revisions":0,"cachedHtml":"<p>Spamming is the use of messaging systems to send an unsolicited message (spam) to large numbers of recipients for the purpose of commercial advertising, for the purpose of non-commercial proselytizing, or for any prohibited purpose (especially the fraudulent purpose of phishing).</p>\n<p>While the most widely recognized form of spam is email spam, the term is applied to similar abuses in other media: instant messaging spam, Usenet newsgroup spam, Web search engine spam, spam in blogs, wiki spam, online classified ads spam, mobile phone messaging spam, Internet forum spam, junk fax transmissions, social spam, spam mobile apps,[1] television advertising and file sharing spam. It is named after Spam, a luncheon meat, by way of a Monty Python sketch about a restaurant that has Spam in almost every dish in which vikings annoyingly sing \"Spam\" repeatedly.[2]</p>\n<p>This wiki has been spammed before.</p>\n<p>Written by FSB</p>"},"The Spanish Inquisition":{"revisions":0,"cachedHtml":"<p>I bet you didnt expect this</p>\n<p>The Tribunal of the Holy Office of the Inquisition (Spanish: Tribunal del Santo Oficio de la Inquisición), commonly known as the Spanish Inquisition (Inquisición española), was established in 1478 by Catholic Monarchs Ferdinand II of Aragon and Isabella I of Castile. It was intended to maintain Catholic orthodoxy in their kingdoms and to replace the Medieval Inquisition, which was under Papal control. It became the most substantive of the three different manifestations of the wider Catholic Inquisition along with the Roman Inquisition and Portuguese Inquisition. The \"Spanish Inquisition\" may be defined broadly, operating in Spain and in all Spanish colonies and territories, which included the Canary Islands, the Kingdom of Naples, and all Spanish possessions in North, Central, and South America. According to modern estimates, around 150,000 were prosecuted for various offenses during the three-century duration of the Spanish Inquisition, out of which between 3,000 and 5,000 were executed (~2.7% of all cases).</p>\n<p>Written by FSB</p>"},"FSB":{"revisions":0,"cachedHtml":"<p>FreakySkeleBone is a trash coder and a repl user that steals wikipedia articles, and makes a joke on a fake wikipedia during history class</p>"},"Quentin Tarintino":{"revisions":0,"cachedHtml":"<p>Quentin Jerome Tarantino (/ˌtærənˈtiːnoʊ/; born March 27, 1963)[1] is an American film director, screenwriter, producer, and actor. His films are characterized by nonlinear storylines, dark humor, aestheticization of violence, extended scenes of dialogue, ensemble casts, references to popular culture and a wide variety of other films, soundtracks primarily containing songs and score pieces from the 1960s to the 1980s, alternate history, and features of neo-noir film.</p>\n<p>Born in Knoxville, Tennessee, Tarantino grew up in Los Angeles. He began his career as an independent filmmaker with the release of Reservoir Dogs in 1992, a crime thriller film which was funded by money from the sale of his screenplay True Romance (1993). Empire magazine hailed Reservoir Dogs as the \"Greatest Independent Film of All Time\". His second film, Pulp Fiction (1994), a crime comedy, was a major success among critics and audiences.[2][3] He wrote the screenplay for the horror comedy film From Dusk till Dawn (1996),[4] in which he also starred. Tarantino paid homage to the blaxploitation films of the 1970s with Jackie Brown (1997), an adaptation of Elmore Leonard's novel Rum Punch.</p>\n<p>In 2003, Tarantino delivered Kill Bill: Volume 1, a stylized \"revenge flick\" in the cinematic traditions of kung fu films and Japanese martial arts; Volume 2 followed in 2004. Tarantino next directed the exploitation slasher film Death Proof (2007), part of a double feature with Robert Rodriguez released in the tradition of 1970s grindhouse cinema, under the collective title Grindhouse. His long-postponed Inglourious Basterds (2009) tells an alternate history of Allied forces in Nazi-occupied France, and was released to favorable reviews; it was followed by Django Unchained (2012), a Spaghetti Western set in the Antebellum South, to further critical favor. His eighth film, The Hateful Eight (2015), was a long-form Western initially screened in a 70 mm roadshow theatrical release. His ninth film, Once Upon a Time in Hollywood (2019), recounts an alternate history of events surrounding the Tate–LaBianca murders.</p>\n<p>Tarantino's films have garnered both critical and commercial success as well as a dedicated cult-following. He has received many industry awards, including two Academy Awards, two BAFTA Awards, four Golden Globe Awards,[5] and the Palme d'Or, and has been nominated for an Emmy and five Grammys. In 2005, he was included on the annual Time 100 list of the most influential people in the world.[6] Filmmaker and historian Peter Bogdanovich has called him \"the single most influential director of his generation\".[7] In December 2015, Tarantino received a star on the Hollywood Walk of Fame for his contributions to the film industry.[8]</p>\n<p>Written by FSB</p>"},"wse":{"revisions":0,"cachedHtml":""},"Doge":{"revisions":0,"cachedHtml":"<p>Doge (often /ˈdoʊdʒ/ DOHJ, /ˈdoʊɡ/ DOHG)[1] is an Internet meme that became popular in 2013. The meme typically consists of a picture of a Shiba Inu dog accompanied by multicolored text in Comic Sans font in the foreground. The text, representing a kind of internal monologue, is deliberately written in a form of broken English.</p>\n<p>The meme is based on a 2010 photograph, and became popular in late 2013, being named as Know Your Meme's \"top meme\" of that year. A cryptocurrency based on Doge, the Dogecoin, was launched in December 2013, and the Shiba Inu has been featured on Josh Wise's NASCAR car as part of a sponsorship deal. Doge has also been referenced by members of the United States Congress, a safety video for Delta Air Lines, a Google Easter egg, and the video for the song \"Word Crimes\" by \"Weird Al\" Yankovic. Toward the end of the decade, the meme saw a resurgence in popularity. Several online polls and media outlets recognized Doge as one of the best Internet memes of the 2010s.</p>\n<p>Structure\nDoge uses two-word phrases in which the first word is almost always one of five modifiers (\"so\", \"such\", \"many\", \"much\", and \"very\"), and the departure from correct English is to use the modifier with a word that it cannot properly modify.[2] For example, \"Much respect. So noble.\" uses the doge modifiers but is not \"proper\" doge because the modifiers are used in a formally correct fashion; the doge version would be \"Much noble, so respect.\"[2] In addition to these phrases, a doge utterance often ends with a single word, most often \"wow\" but with \"amaze\" and \"excite\" also being used.[2]</p>\n<p>Since the inception of the meme, several variations and spin-offs have been created, including \"liquified Doge\",[3][4] a variation wherein the dog's shape is morphed into other animals, and \"ironic Doge\",[3] a version where the Doge character is put into ironic and uncharacteristic situations. The ironic Doge memes have spawned several other related characters, often dogs themselves. One of which is Cheems, another Shiba Inu who is typically characterized by a speech impediment that adds the letter \"M\" throughout its speech.[5] Walter, a bull terrier character who is typically portrayed as liking \"moster trucks\" [sic] and firetrucks, is another commonly recurring ironic Doge character. These memes are mostly present on subreddits like r/dogelore.[6] One meme which became popular in 2020 was \"Swole Doge vs. Cheems\", in which a muscular Doge and a baby Cheems are depicted as something considered better in the past, and its modern version, respectively.[7][8]</p>\n<p>Origin and pronunciation\nKabosu\nOther name(s)    かぼす\nSpecies    Dog\nBreed    Shiba Inu\nSex    Female\nBorn    November 2, 2005 (age 15)[citation needed]\nNation from    Japan\nNotable role    Internet celebrity\nYears active    2010–present\nkabochan.blog.jp, kabosu112.exblog.jp (in Japanese)\nKabosu (Japanese: かぼす), the female Shiba Inu featured in the original meme, is a pedigree puppy who was sent to an animal shelter when her puppy mill shut down. She was adopted in 2008 by Japanese kindergarten teacher Atsuko Satō, and named after the citrus fruit kabosu because Sato thought she had a round face like the fruit.[9] Another Shiba Inu featured in the meme is Suki, a female belonging to photographer Jonathan Fleming from San Francisco. His wife had accidentally put a scarf in the wash, making it shrink. He took a photograph of Suki wearing the scarf outside on a cold night in February 2010.[9]</p>\n<p>Kabosu was first pictured in a 2010 blog post by Sato; afterwards, variations of the pictures using overlaid Comic Sans text were posted from a Tumblr blog, Shiba Confessions.[9][10][11][12] However, the use of the intentionally misspelled \"doge\" dates back to June 2005, when it was mentioned in an episode of Homestar Runner's puppet series.[1] The image began to grow in popularity after it was posted on Reddit in October 2010 in a post titled \"LMBO LOOK @ THIS [EXPLICIT]EN DOGE.\"[3][9]</p>\n<p>Some of the other characters used in the meme are based on photographs of real dogs. Cheems is based on an image of a dog named Balltze, from Hong Kong; he was adopted at the age of one and was nine years old in 2020.[5] Walter is based on the bull terrier Nelson, who originally became popular in 2018 after his owner, Victoria Leigh, posted a picture of Nelson to Twitter, with the caption \"When u open the front-facing camera on accident.\" In 2020, rumors of Nelson's death began to circulate the internet, although they turned out to be false.[6][13]</p>\n<p>The most common pronunciations of \"doge\" are /ˈdoʊdʒ/ DOHJ and /ˈdoʊɡ/ DOHG. In non-English speaking countries, \"doge\" is occasionally pronounced /ˈdɒdʒ/ \"dodge\". Those unfamiliar or unacquainted with the meme also use the pronunciations /ˈdɒɡi/ \"doggie\", /ˈdɒɡeɪ/ DOG-ay, /ˈdoʊɡeɪ/ DOH-gay, or simply /ˈdɒɡ/ \"dog\".[1]</p>"},"ch1ck3n":{"revisions":0,"cachedHtml":"<p>ch1ck3n (Landon) is a user with 154 cycles on repl.it. \nhe is lonely.</p>\n<p>written by ch1ck3n</p>"},"Hello World!":{"revisions":0,"cachedHtml":"<pre><code>console.log('Hello, World!');\n</code></pre>\n<p>However, in python:</p>\n<pre><code>print(\"Hello, world!\")\n</code></pre>\n<p>Also, in html:</p>\n<pre><code>(h2)\n  Hello, world!\n(/h2)\n</code></pre>"},"google":{"revisions":0,"cachedHtml":"<p>google is a top-notch company if you are looking for business helpers because it has limited access personalized by you, but the downsides are the trackers that make money selling pi (personal information) so if you are using google stay safe!</p>"},"yeet":{"revisions":0,"cachedHtml":"<p>throw something and say yeet</p>"},"CSRF Demonstration":{"revisions":0,"cachedHtml":"<p>See https://repl.it/@programmeruser/csrf</p>"}}